In [8]:
#Bibliotecas
import pandas as pd
import numpy as np
#Importando os dados do kaggle
df = pd.read_csv(r'xxxxxxxxxxxxxxxxxxxxxxxxxxxxx')

In [9]:
df.shape #Dimenções

(607, 12)

In [10]:
df.head(3) #visualização

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M

In [11]:
df.isnull().sum() #verificar se existem valores nulos

Unnamed: 0            0
work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [12]:
df.duplicated().sum() #verificar se existem valores duplicados

0

In [13]:
df=df.drop(["salary","salary_currency"],axis=1) #para melhor analise foi retirado essas colunas

In [15]:
dado_procurado = 412000
linha_procurada = df[df['salary_in_usd'] == dado_procurado]

# Exibir a linha encontrada
print(linha_procurada)

    Unnamed: 0  work_year experience_level employment_type       job_title  \
63          63       2020               SE              FT  Data Scientist

    salary_in_usd employee_residence  remote_ratio company_location  \
63         412000                 US           100               US

   company_size
63            L

In [16]:
df = df.drop(63) #foi feita a retirada de um dado de salario(outliers)

In [17]:
# Salvando os dados tratados em um novo arquivo CSV
df.to_csv('dados_tratados.csv', index=False)

In [19]:
dfe = pd.read_csv(r'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx')

In [20]:
df.shape

(606, 10)